{
  "no-interaction-effects": "**There are no interaction effects that make sense given the variable relationships you specified in your Tisane program!** 🤔*Wonder if you should have some to include?* 🤔 Interaction effects represent relationships where one or more variables moderate the effect another independent variable has on a dependent variable. You didn't specify any moderating relationships!\n\n *If you believe you omitted a moderating relationship*, go back to your program and specify it using the ``moderates`` function call. ✋🏽*Take care to only include moderating relationships you believe exist in your domain.* ✋🏽",
  "no-random-effects": "**There are no random effects to include!** Random effects are included to control for clustering in your data. Based on your expressed variable relationships, Tisane detects and automatically includes random effects. In this way, Tisane maximizes the statistical conclusion and external validity, or generalizabilty, if your statistical findings. ",
  "normality-tests": {
    "header": "Explanation of P-Values",
    "body": "For both tests, the null hypothesis is that the data is sampled from a normal distribution. Therefore, a p-value of less than 0.05 is considered to reject the null hypothesis, i.e., the data does not seem to be normally distributed. P-values of more than or equal to 0.05 however do not mean that the data is definitely sampled from a normal distribution.\n\nFor more information on these tests, as well as documentation on their implementations, you can click on the links in the table header.",
    "note": "_(\\* indicates significant p-values)_"
  },
  "link-functions": {
    "header": "About Link Functions",
    "body": "_\\* indicates the default/canonical link function for the chosen family function._\n * Any disabled link functions are not supported by the statistics packages Tisane uses to generate models, `statsmodels` and `pymer4`. As these packages add more support for link functions, more will be available here!\n * The `pymer4` package provides model fitting for models with clustering, and does not support as many link functions. So if you have clustering in your model, you will not have as many options."
  },
  "distribution-families": {
    "header": "About Family Functions",
    "body": "Family functions describe how the errors in the estimated values from a fitted model are distributed....but we haven't gotten to fit one yet! \n\n**How to go about picking a family function?** Pick a family distribution that appears to best match your dependent variable's distribution. Look for overall *shape* and *overlap* between the two distributions shown. More similar in shape and more overlap, likely the better choice.\n\n**Caution:** A histogram of your dependent variable is *not* the same as the distribution of errors. Always check your model's fit. 👉🏽 *Use the model diagnostics code Tisane outputs at the end of your generated script to examine further.*\n\nNote: if your model has clustering, you may have less choices for family functions. The statistics package `pymer4` that is the backend for model fitting for models with clustering does not support as many family functions as `statsmodels`, which Tisane uses when fitting a model without clustering."
  },
  "overall-main-effects": "*Main independent variables* are variables whose influence on the dependent variable you are interested in.\n\nTisane derives main independent variables based on the `causes` and `associates_with` relationships you specified in your Tisane program.",
  "overall-interaction-effects": "*Interactions* describe how one variable may influence how a second variable causes or is associated with a third variable.\n\nTisane derives interactions based on the `moderates` relationships you specify in your Tisane program.",
  "overall-random-effects": "*Accounting for data clusters* help us control for data clusters that arise due to how data were collected. For example, if there are multiple observations from the same unit (i.e., repeated measures), data is hierarchical, or there are multiple ways to group observations that might overlap (i.e., non-nesting).\n\nTisane infers clustering and controls based on the variable relationships you have declared and automatically includes them whenever necessary to maximize generalizability.",
  "random-effects-not-available": "**Why are some columns grayed out?** Based on the main effects and interaction effects you have included in your statistical model, it does not make sense to include these random effects. These would either be computationally infeasible or redundant in the model."
}
